// Խնդիր 1․
//   Գրել palindrome անունով ֆունկցիա, որը շրջում է string-ը, օր՝ "hello" => "olleh"
//   Ֆունկցիան գրել երկու տարբերակով,
//     1․ չօգտագործել ոչ մի մեթոդ, օգտվել միայն ամենապարզ ցիկլից
//     2․ օգտվել մեթոդներից
// Խնդիր 2․ Գտնել 1-100 բոլոր պարզ թվերի քանակը
// Խնդիր 3․ Գտնել եռանկյան մակերեսը ունենալով բոլոր երեք կողմերի երկարությունները
// Խնդիր 4․ Ստեղծել կանստռուկտոր ֆունքցիա, որը ստեղծում է հեռուստացույց տվյալ պահանջներով՝
//    Հատկություններ՝
//      1․ model => string
//      2. year => number
//      3. diameter => number
//      4․ currentChannel => string
//      5. volume => number
//      6․ on/off => true/false
//    Մեթոդներ՝
//      1․ Կարողանում է փոխել ալիքը
//      2․ Կարողանում է բարձրացնել ձայնը
//      3․ Կարողանում է ցածրացնել ձայնը
//      4․ Միացնել և անջատել


////////////////////////////// Խնդիր 2․ Գտնել 1-100 բոլոր պարզ թվերի քանակը/////////////////////////////////////

// function one_and_handrid(N) {
// let total = 0
// for(let i = 0; i <= N; i++){
//     total += i 
// }
    
// return total    
// }

// console.log(one_and_handrid(100))

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

//// 1 ban chjoga /////////////////
// let arr = ["h","e","l","l","o"]

// for(let i = 6; i > arr.length; i-- ){

// console.log(arr)

// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////

///////////Խնդիր 4․ Ստեղծել կանստռուկտոր ֆունքցիա, որը ստեղծում է հեռուստացույց տվյալ պահանջներով՝///////////

// function TV(model,year,diameter,currentChannel,volume,on_off) {
// this.model = model
// this.year = year  
// this.diameter = diameter
// this.currentChannel = currentChannel
// this.volume = volume
// this.on_off = on_off
// }

// const VT = new TV("LG","2019","30","h1","450000", "true")
// console.log(VT)

////////////////////////////////////////////////////////////////////////////////////////////////////////////


// let result = arr.reduce((a, b) => {
//     return a * b
// }, 1)

// console.log(result)

//////////////////Գտնել եռանկյան մակերեսը ունենալով բոլոր երեք կողմերի երկարությունները/////////////////////
// let arr = [15,10,12]
// let result = arr.reduce((a, b) => {
// return a * b

// })

// console.log(result)
//
//////////////////////////////////////////////////////////////////////////////////////
